artillery/scenarios/deprecated/artillery-single-endpoint.yml
config:
  target: "{{ $processEnvironment.HOST_URL }}"
  defaults:
    headers:
      PRIVATE-TOKEN: "{{ $processEnvironment.ACCESS_TOKEN }}"
      Accept: "application/json"
  phases:
    - duration: "{{ $processEnvironment.WARMUP_DURATION }}"
      arrivalRate: "{{ $processEnvironment.WARMUP_ARRIVAL_RATE }}"
      name: "Warm up"
    - duration: "{{ $processEnvironment.RAMPUP_DURATION }}"
      arrivalRate: "{{ $processEnvironment.WARMUP_ARRIVAL_RATE }}"
      rampTo: "{{ $processEnvironment.RAMPUP_ARRIVAL_RATE }}"
      name: "Gradual ramp up"
    - duration: "{{ $processEnvironment.FULL_LOAD_DURATION }}"
      arrivalRate: "{{ $processEnvironment.FULL_LOAD_ARRIVAL_RATE }}"
      name: "Sustained load"
scenarios:
  - name: "Visit {{ $processEnvironment.API_ENDPOINT }}"
    flow:
      - get:
          url: "{{ $processEnvironment.API_ENDPOINT }}"